Autodesk.Revit.UI.RibbonPanel.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another panel object.

Autodesk.Revit.UI.RibbonPanel.AddSlideOut
Adds a slideout to the current panel.
Remarks:  The slideout part of the panel can be shown by clicking on the arrow at the bottom of the panel.
After calling AddSlideOut(), any subsequent calls to add new items will add the new item(s) to the slideout.
The slideout part of the panel will be shown only if items are added after this call.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when a slide out panel is already added.
Since: 2011

Autodesk.Revit.UI.RibbonPanel.AddStackedItems(Autodesk.Revit.UI.RibbonItemData,Autodesk.Revit.UI.RibbonItemData,Autodesk.Revit.UI.RibbonItemData)
Adds three stacked items to the panel.
item1:  Data containing information about the first item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
item2:  Data containing information about the second item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
item3:  Data containing information about the third item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
Returns:  A collection containing the added items.
Remarks:  Each new item may either be a PushButton, PulldownButton, SplitButton, ComboBox or TextBox, depending upon the type of
data passed in for each argument. The new items will be created as small-size horizontal controls,
with the first stacked on top of the second in the panel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when item1, item2 or item3 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an item with item1.Name or item2.Name or item3.Name already exists in the panel or the data is not of the correct type.
Since: 2011

Autodesk.Revit.UI.RibbonPanel.AddStackedItems(Autodesk.Revit.UI.RibbonItemData,Autodesk.Revit.UI.RibbonItemData)
Adds two stacked items to the panel.
item1:  Data containing information about the first item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
item2:  Data containing information about the second item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.
Returns:  A collection containing the added items.
Remarks:  Each new item may either be a PushButton, PulldownButton, SplitButton, ComboBox or TextBox, depending upon the type of
data passed in for each argument. The new items will be created as small-size horizontal controls,
with the first stacked on top of the second in the panel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when item1 or item2 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an item with the item1.Name or item2.Name already exists in the panel or the data is not of the correct type.
Since: 2011

Autodesk.Revit.UI.RibbonPanel.AddItem(Autodesk.Revit.UI.RibbonItemData)
Adds a Ribbon item to the panel.
itemData:  Data containing information about the new item.
Returns:  The added Ribbon item.
Remarks:  The new item may either be a PushButton, PulldownButton, SplitButon, RadioButtonGroup, ComboBox, or TextBox depending upon the type of data passed in.
The new item may be created as a large-size vertical control in the panel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when itemData is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an item with the itemData.Name already exists in the panel or the data is not of the correct type.
Since: 2011

Autodesk.Revit.UI.RibbonPanel.AddSeparator
Adds a new Separator to the panel.
Remarks: The separator won't be shown if there are no items already added to the panel.

Autodesk.Revit.UI.RibbonPanel.GetItems
Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.
Remarks: This method gets the items assigned to the RibbonPanel.

Autodesk.Revit.UI.RibbonPanel.Enabled
Gets or sets a value indicating whether the RibbonPanel can respond to user interaction.
True if the panel allows interaction, false if the panel disallows interaction with all the controls it contains.

Autodesk.Revit.UI.RibbonPanel.Visible
Gets or sets a value indicating whether the RibbonPanel is displayed.
True if the RibbonPanel is displayed; otherwise, false. The default is true.

Autodesk.Revit.UI.RibbonPanel.Title
Gets or sets the text of the RibbonPanel.
Remarks: If this property is not set, the default value is its Name.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the title contains angle bracket.

Autodesk.Revit.UI.RibbonPanel.Name
Gets or sets the name of the RibbonPanel.
Remarks: The name will be displayed on the panel if the Text is not set.

Autodesk.Revit.UI.RibbonPanel
Represents a panel added by an External Application or External Command into the Add-Ins tab.
Remarks: The Panel class provides read and write access to the RibbonItems contained in the panel. Use of this class is not supported in Revit Macros.